<?php
return array(
	'department_type' => array( //部门类型
		1 => '支队',
		2 => '大队',
		3 => '中队',
		4 => '其他',
	),
	'checkup_org_obj' => array( // 检验鉴定对象
		1 => '人员',
		2 => '车辆',
		3 => '其他',
	),
	'accident_type' => array( // 事故类型
		1 => '财产损失事故',
		2 => '伤人事故',
		3 => '死亡事故',
	),
	'certificate_type' => array( //证件类型
		1 => '居民身份证',
		2 => '军人证',
		3 => '士兵证',
		4 => '警官证',
		5 => '港澳台居民身份证',
		6 => '护照',
		7 => '户口簿',
	),
	'record_type' => array( //笔录类型
		0 => '询问笔录',
		1 => '讯问笔录',
		2 => '谈话笔录',
	),
	'duty_group_type' => array( //值班分组
		0 => 'A组',
		1 => 'B组',
		2 => 'C组',
		3 => 'D组',
		4 => 'E组',
		5 => 'F组',
	),
	'driver_licence_type' => array( //驾驶证种类
		1 => '机动车',
		2 => '拖拉机',
		3 => '军队',
		4 => '武警',
		5 => '无证驾驶',
	),
	'traffic_type' => array( //交通方式
		1 => '步行',
		2 => '乘摩托车',
		3 => '驾驶普通摩托车',
		4 => '驾驶小型客车',
		5 => '驾驶中型客车',
		6 => '驾驶中型货车',
		7 => '驾驶重型货车',
		8 => '非道路交通事故当事人',
	),
	'grade_type' => array( //号牌种类
		'01' => '大型汽车号牌',
		'02' => '小型汽车号牌',
		'03' => '使馆汽车号牌',
		'04' => '领馆汽车号牌',
		'05' => '境外汽车号牌',
		'06' => '外籍汽车号牌',
		'07' => '普通摩托车号牌',
		'08' => '轻便摩托车号牌',
		'09' => '使馆摩托车号牌',
		'10' => '领馆摩托车号牌',
		'11' => '境外摩托车号牌',
		'12' => '外籍摩托车号牌',
		'13' => '低速车号牌',
		'14' => '拖拉机号牌',
		'15' => '挂车号牌',
		'16' => '教练汽车号牌',
		'17' => '教练摩托车号牌',
		'18' => '实验汽车号牌',
		'19' => '实验摩托车号牌',
		'20' => '临时入境汽车号牌',
		'21' => '临时入境摩托车号牌',
		'22' => '临时行驶车号牌',
		'23' => '警用汽车号牌',
		'24' => '警用摩托车号牌',
		'25' => '原农机号牌',
		'26' => '香港入境车号牌',
		'27' => '澳门入境车号牌',
		'31' => '武警号牌',
		'41' => '无号牌',
		'42' => '假号牌',
		'43' => '挪用号牌',
	),
	'blame_type' => array( //事故责任B
		1 => '全部',
		2 => '主要',
		3 => '同等',
		4 => '次要',
		5 => '无责',
		6 => '无法认定',
	),
	'hurt_type' => array( //伤害程度
		1 => '死亡',
		2 => '重伤',
		3 => '轻伤',
		4 => '不明',
		5 => '无伤害',
	),
	'rights_obligations' => array( //权利义务告知
		1 => '道路交通事故权利义务告知书',
		2 => '犯罪嫌疑人权利义务告知书',
		3 => '行政案件权利义务告知书',
	),
	'phrase_tamplate_cate' => array( //短语模板分类
		//快赔简易事故认定书 主键id=1
		0 => array('id' => '1', 'pid' => '0', 'name' => '快赔简易事故认定书'),
		1 => array('id' => '2', 'pid' => '1', 'name' => '交通事故事实及责任'),
		2 => array('id' => '3', 'pid' => '1', 'name' => '损害赔偿'),
		//现场勘查信息	主键id=4
		3 => array('id' => '4', 'pid' => '0', 'name' => '现场勘查信息'),
		4 => array('id' => '5', 'pid' => '4', 'name' => '道路'),
		5 => array('id' => '6', 'pid' => '4', 'name' => '交通环境'),
		//询问笔录	主键id=7
		6 => array('id' => '7', 'pid' => '0', 'name' => '询问笔录'),
		7 => array('id' => '8', 'pid' => '7', 'name' => '笔录短语模板'),
		//检验鉴定 主键id=9
		8 => array('id' => '9', 'pid' => '0', 'name' => '检验鉴定'),
		9 => array('id' => '10', 'pid' => '9', 'name' => '检验鉴定送审'),
		//事故认定 主键id=11
		10 => array('id' => '11', 'pid' => '0', 'name' => '事故认定'),
		11 => array('id' => '12', 'pid' => '11', 'name' => '简易事故认定'),
		12 => array('id' => '13', 'pid' => '12', 'name' => '交通事故事实及责任'),
		13 => array('id' => '14', 'pid' => '12', 'name' => '损害赔偿'),
		14 => array('id' => '15', 'pid' => '11', 'name' => '调查报告'),
		15 => array('id' => '16', 'pid' => '15', 'name' => '当事人情况短语模板维护'),
		16 => array('id' => '17', 'pid' => '15', 'name' => '车辆情况'),
		17 => array('id' => '18', 'pid' => '15', 'name' => '道路情况'),
		18 => array('id' => '19', 'pid' => '15', 'name' => '交通事故的基本事实'),
		19 => array('id' => '20', 'pid' => '15', 'name' => '交通事故的证据、检验、鉴定结论'),
		20 => array('id' => '21', 'pid' => '15', 'name' => '道路交通事故成因分析'),
		21 => array('id' => '22', 'pid' => '15', 'name' => '责任认定'),
		22 => array('id' => '23', 'pid' => '15', 'name' => '处罚意见'),
		23 => array('id' => '24', 'pid' => '15', 'name' => '整改措施'),
		//调解 主键id=25
		24 => array('id' => '25', 'pid' => '0', 'name' => '调解'),
		25 => array('id' => '26', 'pid' => '25', 'name' => '调解通知书'),
		26 => array('id' => '27', 'pid' => '25', 'name' => '不调解通知书'),
		27 => array('id' => '28', 'pid' => '25', 'name' => '调解记录'),
		28 => array('id' => '29', 'pid' => '25', 'name' => '道路交通事故损害赔偿调解书'),
		29 => array('id' => '30', 'pid' => '25', 'name' => '道路交通事故损害赔偿调解终结书'),

		//补充20160817
		//事故认定 主键id=11 -----交通道路事故证明
		30 => array('id' => '31', 'pid' => '11', 'name' => '交通道路事故证明'),
		31 => array('id' => '32', 'pid' => '31', 'name' => '当事方基本情况'),
		32 => array('id' => '33', 'pid' => '31', 'name' => '调查交通道路得到的事实'),
		//事故认定 主键id=11 -----呈请事故中止
		33 => array('id' => '34', 'pid' => '11', 'name' => '呈请事故中止'),
		34 => array('id' => '35', 'pid' => '34', 'name' => '中止短语'),

		///事故认定 主键id=11 -----事故认定
		35 => array('id' => '36', 'pid' => '11', 'name' => '事故认定'),
		36 => array('id' => '37', 'pid' => '36', 'name' => '当事人、车辆、道路和交通环境等基本情况'),
		37 => array('id' => '38', 'pid' => '36', 'name' => '道路交通事故发生的经过'),
		38 => array('id' => '39', 'pid' => '36', 'name' => '道路交通事故证据及事故形成原因分析'),
		39 => array('id' => '40', 'pid' => '36', 'name' => '当事人导致交通事故的过错及责任或意外原因'),

	),
	'recover_type' => array( //采血管回收方式
		1 => '检验鉴定回收',
		2 => '备份血样',
		3 => '失效管回收',
	),
	'client_relation' => array( //与当事人关系
		1 => "亲属",
		2 => "近亲属",
		3 => "法定代理人",
		4 => "委托代理人",
		5 => "责任人",
	),
	'item_name' => array( //物品名称
		1 => '机动驾驶证',
		2 => '其它驾驶证',
		3 => '其它物品',
	),
	'revoke_years' => array( //吊销时长
		1 => '2年',
		2 => '3年',
		3 => '5年',
		4 => '10年',
	),
	'criminal_coercive_measures' => array( //刑事强制措施
		1 => '刑事拘留',
		2 => '逮捕',
		3 => '取保候审',
		4 => '移送起诉',
	),
	'parking_lot' => array( //停车场
		1 => '停车场1',
		2 => '停车场2',
		3 => '停车场3',
		4 => '停车场4',
		5 => '停车场5',
	),
	'photo_cate' => array( //上传图片类型
		1 => '受案登记',
		2 => '当事人',
		3 => '现场图',
		4 => '现场照片',
		5 => '方位照相',
		6 => '概览照相',
		7 => '局部照相',
		8 => '元素照相',
		9 => '现场勘查笔录',
		10 => '现场遗留物品清单',
		11 => '档案借出',
		12 => '档案查阅',
		13 => '档案复制',
		14 => '简易事故认定',
		15 => '逃逸事故认定书',
		16 => '逃逸事故认定-书面申请材料',
		17 => '逃逸事故认定-送达回执',
		18 => '调查报告',
		19 => '一般事故认定-事故认定',
		20 => '一般事故认定-事故认定-送达回执',
		21 => '呈请事故中止',
		22 => '道路交通事故证明',
		23 => '当事人责任无法认定-道路交通事故证明-送达回执',
		24 => '公安交通管理行政处罚决定书',
		25 => '行政处罚决定书',
		26 => '行政拘留回执',
		27 => '刑事拘留文书',
		28 => '逮捕文书',
		29 => '取保候审文书',
		30 => '移送起诉文书',
		38 => '提请重新检验鉴定书面材料',
		39 => '检验鉴定委托书',
		40 => '检验鉴定-延期',
		41 => '检验鉴定-超期',
		42 => '检验鉴定-延期并超期',
		43 => '检验鉴定-告知',
		44 => '检验鉴定-鉴定结果',
//		45 => '询问、询问、谈话笔录',
		46 => '复核受理通知书',
		47 => '复核不予受理通知书',
		48 => '复核审批意见',
		49 => '复核结论',
		50 => '复核结论送达通知',
		51 => '复核终止',
		52 => '复核答复',
		53 => '调解申请书',
		54 => '不调解通知书',
		55 => '集体研究记录',
		56 => '调解通知书',
		57 => '调解记录',
		58 => '道路交通事故损害赔偿调解书',
		59 => '道路交通事故损害赔偿调解终结书',
		60 => '工作记录',
		61 => '询问笔录',
		62 => '讯问笔录',
		63 => '谈话笔录',
		64 => '协议书',
	),
	'check_type' => array( //审批类型
		0 => "受案登记",
		2 => "一般事故认定-事故认定",
		3 => "一般事故认定-呈请事故中止",
		4 => " 当事人责任无法判定-道路交通事故证明",
		10 => "检验鉴定-延期",
		11 => "检验鉴定-超期",
		12 => "检验鉴定-延期并超期",
		13 => "检验鉴定-重新申请检验鉴定",
		20 => '复核科 - 复核结论',
	),
	'case_checkup_review_type' => array( //检验鉴定审核类型
		0 => "检验鉴定-延期",
		1 => "检验鉴定-超期",
		2 => "检验鉴定-延期并超期",
		3 => "检验鉴定-重新申请检验鉴定",
	),
	'case_checkup_review_title_type' => array( //检验鉴定标题类型
		0 => "延期",
		1 => "超期",
		2 => "延期并超期",
		3 => "重新申请检验鉴定",

	),
	'scene_state' => array( //现场形态
		1 => '原始',
		2 => '变动',
		3 => '驾车逃逸',
		4 => '弃车逃逸',
		5 => '无现场',
		6 => '二次现场',
		7 => '伪造现场',
	),
	'archive_keyword' => array( //档案管理 操作关键词
		0 => "提档",
		1 => "归还",
		2 => "借阅",
		3 => "借出",
	),
	'case_checkup_obj_type' => array( //检验鉴定 鉴定对象
		1 => '人员',
		2 => '车辆',
		3 => '其他',
	),
	'document_issue_type' => array( //文件告知类型
		1 => '逃逸事故认定',
		2 => '一般事故认定',
		3 => '当事人责任无法认定',
		4 => '复核受理通知书',
		5 => '复核不受理通知书',
		6 => '复核结论',
		7 => '复核终止',
	),
	'review_type' => array( // 复核科-审批 复核方式
		1 => '认证复核',
	),
	'file_cate' => array( //上传文件类型
		1 => '法律法规文书',
	),
	'catalog' => array( //文书查看目录
		array(
			'text' => '案件基本信息',
			'cate' => array(1),
			'nodes' => array(
				array(
					'text' => '受案登记表',
					'cate' => array(1),
				),
			),
		),
		array(
			'text' => '现场勘查信息',
			'cate' => array(3, 9, 10, 5, 6, 7, 8),
			'nodes' => array(
				array(
					'text' => '现场图',
					'cate' => array(3),
				),
				array(
					'text' => '现场照片',
					'cate' => array(5, 6, 7, 8),
					'nodes' => array(
						array(
							'text' => '方位照相',
							'cate' => array(5),
						),
						array(
							'text' => '概览照相',
							'cate' => array(6),
						),
						array(
							'text' => '局部照相',
							'cate' => array(7),
						),
						array(
							'text' => '元素照相',
							'cate' => array(8),
						),
					),
				),
				array(
					'text' => '现场勘查笔录',
					'cate' => array(9),
				),
				array(
					'text' => '现场遗留物品清单',
					'cate' => array(10),
				),
			),
		),
		array(
			'text' => '当事人信息',
			'cate' => array(2),
			'nodes' => array(
				array(
					'text' => '当事人相关文件',
					'cate' => array(2),
				),
			),
		),
		array(
			'text' => '询问笔录、讯问笔录与谈话记录',
			'cate' => array(61, 62, 63),
			'nodes' => array(
				array(
					'text' => '询问笔录',
					'cate' => array(61),
				),
				array(
					'text' => '讯问记录',
					'cate' => array(62),
				),
				array(
					'text' => '谈话记录',
					'cate' => array(63),
				),
			),
		),
		array(
			'text' => '检验鉴定',
			'cate' => array(38, 39, 40, 41, 42, 43, 44),
			'nodes' => array(
				array(
					'text' => '提请重新检验鉴定书面材料',
					'cate' => array(38),
				),
				array(
					'text' => '检验鉴定委托书',
					'cate' => array(39),
				),
				array(
					'text' => '检验鉴定-延期',
					'cate' => array(40),
				),
				array(
					'text' => '检验鉴定-超期',
					'cate' => array(41),
				),
				array(
					'text' => '检验鉴定-延期并超期',
					'cate' => array(42),
				),
				array(
					'text' => '检验鉴定-告知',
					'cate' => array(43),
				),
				array(
					'text' => '检验鉴定-鉴定结果',
					'cate' => array(44),
				),
			),
		),
		array(
			'text' => '事故认定',
			'cate' => array(14, 15, 16, 17, 18, 19, 20, 21, 22, 23),
			'nodes' => array(
				array(
					'text' => '简易事故认定',
					'cate' => array(14),
				),
				array(
					'text' => '逃逸事故认定书',
					'cate' => array(15),
				),
				array(
					'text' => '逃逸事故认定-书面申请材料',
					'cate' => array(16),
				),
				array(
					'text' => '逃逸事故认定-送达回执',
					'cate' => array(17),
				),
				array(
					'text' => '调查报告',
					'cate' => array(18),
				),
				array(
					'text' => '一般事故认定-事故认定',
					'cate' => array(19),
				),
				array(
					'text' => '一般事故认定-事故认定-送达回执',
					'cate' => array(20),
				),
				array(
					'text' => '呈请事故中止',
					'cate' => array(21),
				),
				array(
					'text' => '道路交通事故证明',
					'cate' => array(22),
				),
				array(
					'text' => '当事人责任无法认定-道路交通事故证明-送达回执',
					'cate' => array(23),
				),
			),
		),
		array(
			'text' => '处罚',
			'cate' => array(24, 25, 26, 27, 28, 29, 30),
			'nodes' => array(
				array(
					'text' => '公安交通管理行政处罚决定书',
					'cate' => array(24),
				),
				array(
					'text' => '行政处罚决定书',
					'cate' => array(25),
				),
				array(
					'text' => '行政拘留回执',
					'cate' => array(26),
				),
				array(
					'text' => '刑事拘留文书',
					'cate' => array(27),
				),
				array(
					'text' => '逮捕文书',
					'cate' => array(28),
				),
				array(
					'text' => '取保候审文书',
					'cate' => array(29),
				),
				array(
					'text' => '移送起诉文书',
					'cate' => array(30),
				),
			),
		),
		array(
			'text' => '调解',
			'cate' => array(53, 54, 55, 56, 57, 58),
			'nodes' => array(
				array(
					'text' => '调解申请书',
					'cate' => array(53),
				),
				array(
					'text' => '不调解通知书',
					'cate' => array(54),
				),
				array(
					'text' => '调解通知书',
					'cate' => array(56),
				),
				array(
					'text' => '调解记录',
					'cate' => array(57),
				),
				array(
					'text' => '道路交通事故损害赔偿调解书',
					'cate' => array(58),
				),
				array(
					'text' => '道路交通事故损害赔偿调解终结书',
					'cate' => array(59),
				),
			),
		),
        array(
            'text' => '复核记录',
            'cate' => array(46, 47, 48, 49, 50, 51, 52),
            'nodes' => array(
                array(
                    'text' => '复核受理通知书',
                    'cate' => array(46),
                ),
                array(
                    'text' => '复核不予受理通知书',
                    'cate' => array(47),
                ),
                array(
                    'text' => '复核审批意见',
                    'cate' => array(48),
                ),
                array(
                    'text' => '复核结论',
                    'cate' => array(49),
                ),
                array(
                    'text' => '复核结论送达通知',
                    'cate' => array(50),
                ),
                array(
                    'text' => '复核终止',
                    'cate' => array(51),
                ),
                array(
                    'text' => '复核答复',
                    'cate' => array(52),
                ),
            ),
        ),
		array(
			'text' => '归档信息',
			'cate' => array(11, 12, 13),
			'nodes' => array(
				array(
					'text' => '档案借出',
					'cate' => array(11),
				),
				array(
					'text' => '档案查阅',
					'cate' => array(12),
				),
				array(
					'text' => '档案复制',
					'cate' => array(13),
				),
			),
		),
		array(
			'text' => '工作记录',
			'cate' => array(60),
			'nodes' => array(
				array(
					'text' => '工作记录',
					'cate' => array(60),
				),
			),
		),
		array(
			'text' => '集体研究记录',
			'cate' => array(55),
			'nodes' => array(
				array(
					'text' => '集体研究记录',
					'cate' => array(55),
				),
			),
		),
	),
	'status_type' => array(
		'1' => '受案登记待提交',
		'2' => '受案登记待审批',
		'3' => '检验鉴定延期、超期待审批',
		'4' => '检验鉴定超期待审批',
		'5' => '检验鉴定延期待审批',
		'6' => '委托检验鉴定',
		'7' => '简易事故认定待保存',
		'8' => '事故认定待保存',
		'9' => '调查报告待提交',
		'10' => '待制作事故认定',
		'11' => '事故认定待送达',
		'12' => '待调解',
		'13' => '待处罚',
		'14' => '待归档',
		'15' => '提请复核',
		'16' => '复核受理',
		'17' => '已归档',
	),
);
?>